if 1: #토공사
    print("발파는 인근 지역의 인부/장비 작업시간을 배제 후 실시하며 발파 후 5분 이내는 출입 금지한다.")
    print("전색 시 정전기 방지 복장을 착용하여 안전사고를 예방한다.")
    print("기온은 ℃ 이하에서 진행되어야 한다.")

if 2: #기초공사
    print("")

if 3: #콘크리트 공사
    print("하루평균 기온이 4°C이하가 예상될 경우는 한중 콘크리트로 시공한다")
    print("하루평균 기온이 25°C이상이 예상될 경우 또는 일 최고온도가 30°C를 초과하는 경우는 서중콘크리트로 시공한다.")
    print("5°C이하에서는 모르타르 작업을 할 수 없으며, -10°C이하에서는 콘크리트 치기를 할 수 없다.")
    print("방수 및 고정처리가 절실히 필요한 부위는 타설 전 반드시 확인한다.")
    print("지하 외벽으로부터 내부로 관통하는 각종 슬리브는 누수방지용 설치여부를 반드시 확인한다.")

if 4: #조적공사
    print("풍압이 시속 10km를 넘을 경우에는 바람막이를 설치한 후 시공한다.")
    print("벽돌 쌓은 후 12시간 동안 하중을 받지 않도록 관리해야 한다.")

if 5: #미장공사
    print("시공전 : 미장 근접부위 오손되지 않도록 보양, 통품, 일조, 비, 바람등을 막기")
    print("시공중 :  3°C 이하에서 시공금지, 5°C 이상 유지하며 급격한 건조를 방지한다.")
    print("시공후 : 먼지 부착우려 부위 방풍보양, 조기 건조 우려부위 시트 보양")

if 6: #방수공사
    print("방수층 시공을 할 때에는 주위의 기온이 5℃ 이상이어야하고 얼음, 서리, 습기가 없어야한다.")
    print("유독가스를 방지하기 위해 환기조치를 하여야한다.")
    print("강우 및 강설 후 바탕이 아직 건조되지 않은 경우에는 방수시공을 하지 않는 것을 원칙으로 한다.")

if 7: #지붕공사
    print("")

if 8: #창호공사
    print("주자재 및 부자재는 K.S품을 사용함을 원칙으로 하고, 기타 규정품 이외의 것은 감독원의 승인을 득하여 사용한다.")

if 9: #도장공사
    print("온도 5℃이하, 습도 80%이상의 저온, 다습조건을 피해야 한다.")
    print("먼지가 발생하거나 바람이 많이 부는 환경에서는 도장작업을 금지한다.")
    print("바람이 많이 부는 날은 외부 도장작업을 중지한다.")
    print("도장재, 도료가 묻어 있는 용기, 작업부산물 등은 특정폐기물에 해당되므로 폐기물 관리법에 따라 적법하게 폐기하도록 관리한다.")
    print("도장 횟수를 확인 할 수 있도록 매회 약간 다른 색깔의 것을 도장하며 화재에 유의하고 직사일광을 될 수 있는 한 피해야한다.")

if 10: #석공공사
    print("벽돌이나 석재를 절단 및 가공할 때는 날카롭고 위험한 가공 장비들을 이용하기 때문에 다치지 않도록 주의하고 안전모, 안전화, 안전벨트와 같은 안전장비를 착용해야 한다.")

if 11: #하수도공사
    print("개구부에는 난간, 조명설비 등을 설치, 관계자 이외의 출입금지 등의 조치를 한다.")
    print("높은 곳 작업을 할 때에는 비계 또는 안전그물을 깔고 견고한 작업대, 가설통로를 설치한다.")

if 12: #거푸집공사
    print("강풍, 큰비, 눈비 내릴 때에는 작업을 중지한다.")
    print("해체한 거푸집을 높은 곳에서 떨어뜨리지 않도록 철저히 지시한다")
